#include "TextureConverter.h"

#include "StringUtil.h"

void TextureConverter::ConvertTextureWICToDDS(const std::string& _filePath) {
    /// ==================================================================
    // 1. テクスチャの読み込み
    /// ==================================================================
    LoadWICTextureFromFile(_filePath);

    /// ==================================================================
    // 2. DDS 形式に変換
    /// ==================================================================
}

void TextureConverter::LoadWICTextureFromFile(const std::string& _filePath) {
    std::wstring wFilePath = ConvertMultiByteToWide(_filePath);

    /// ==================================================================
    // 1. テクスチャの読み込み
    /// ==================================================================

    /// ==================================================================
    // 2. 読み込んだディフーズテクスチャを SRGBとして扱う
    /// ==================================================================
}
